  {
    "Barbarian": {
      "name": "Barbarian",
      "Hit Points": {
        "Hit Dice": "1d12",
        "Hit points at first level": "12 + CON"
      },
      "Equipment": {
        "heading": "You start with the following equipment, in addition to the equipment granted by your background:",
        "options": [
          [
            "Greataxe",
            "Any martial melee weapon"
          ],
          [
            "2 Handaxes",
            "Any simple weapon"
          ],
          "An explorer’s pack and four javelins"
        ]
      },
      "Proficiencies": {
        "Tools": [],
        "Weapons": [
          "Simple",
          "Martial"
        ],
        "Armor": [
          "Light armor",
          "Medium armor",
          "Shield"
        ],
        "Saving Throws": [
          "Strength",
          "Constitution"
        ],
        "Skills": {
          "Options": [
            "Animal Handling",
            "Athletics",
            "Intimidation",
            "Nature",
            "Perception",
            "Survival"
          ],
          "Amount": 2
        }
      },
      "Features": {
        "Reckless Attack": "Starting at 2nd level, you can throw aside all concern for defense to attack with fierce desperation. When you make your first attack on your turn, you can decide to attack recklessly. Doing so gives you advantage on melee weapon attack rolls using Strength during this turn, but attack rolls against you have advantage until your next turn.",
        "Unarmored Defense": "While you are not wearing any armor, your Armor Class equals 10 + your Dexterity modifier + your Constitution modifier. You can use a shield and still gain this benefit.",
        "Relentless Rage": [
          "Starting at 11th level, your rage can keep you fighting despite grievous wounds. If you drop to 0 hit points while you’re raging and don’t die outright, you can make a DC 10 Constitution saving throw. If you succeed, you drop to 1 hit point instead.",
          "Each time you use this feature after the first, the DC increases by 5. When you finish a short or long rest, the DC resets to 10."
        ],
        "Danger Sense": [
          "At 2nd level, you gain an uncanny sense of when things nearby aren’t as they should be, giving you an edge when you dodge away from danger.",
          "You have advantage on Dexterity saving throws against effects that you can see, such as traps and spells. To gain this benefit, you can’t be blinded, deafened, or incapacitated."
        ],
        "Persistent Rage": "Beginning at 15th level, your rage is so fierce that it ends early only if you fall unconscious or if you choose to end it.",
        "Ability Score Improvement": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
        "Indomitable Might": "Beginning at 18th level, if your total for a Strength check is less than your Strength score, you can use that score in place of the total.",
        "Brutal Critical": [
          "Beginning at 9th level, you can roll one additional weapon damage die when determining the extra damage for a critical hit with a melee attack.",
          "This increases to two additional dice at 13th level and three additional dice at 17th level."
        ],
        "Fast Movement": "Starting at 5th level, your speed increases by 10 feet while you aren’t wearing heavy armor.",
        "Primal Path": "At 3rd level, you choose a path that shapes the nature of your rage. Choose the Path of the Berserker or the Path of the Totem Warrior, both detailed at the end of the class description. Your choice grants you features at 3rd level and again at 6th, 10th, and 14th levels.",
        "Rage": {
          "content": [
            "In battle, you fight with primal ferocity. On your turn, you can enter a rage as a bonus action.",
            "While raging, you gain the following benefits if you aren’t wearing heavy armor:",
            [
              "You have advantage on Strength checks and Strength saving throws.",
              "When you make a melee weapon attack using Strength, you gain a bonus to the damage roll that increases as you gain levels as a barbarian, as shown in the Rage Damage column of the Barbarian table.",
              "You have resistance to bludgeoning, piercing, and slashing damage."
            ],
            "If you are able to cast spells, you can’t cast them or concentrate on them while raging.",
            "Your rage lasts for 1 minute. It ends early if you are knocked unconscious or if your turn ends and you haven’t attacked a hostile creature since your last turn or taken damage since then. You can also end your rage on your turn as a bonus action.",
            "Once you have raged the number of times shown for your barbarian level in the Rages column of the Barbarian table, you must finish a long rest before you can rage again."
          ]
        },
        "Feral Instinct": [
          "By 7th level, your instincts are so honed that you have advantage on initiative rolls.",
          "Additionally, if you are surprised at the beginning of combat and aren’t incapacitated, you can act normally on your first turn, but only if you enter your rage before doing anything else on that turn."
        ],
        "Extra Attack": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
        "Primal Champion": "At 20th level, you embody the power of the wilds. Your Strength and Constitution scores increase by 4. Your maximum for those scores is now 24."
      },
      "Level Table": {
        "Level": [
          "1st",
          "2nd",
          "3rd",
          "4th",
          "5th",
          "6th",
          "7th",
          "8th",
          "9th",
          "10th",
          "11th",
          "12th",
          "13th",
          "14th",
          "15th",
          "16th",
          "17th",
          "18th",
          "19th",
          "20th"
        ],
        "Proficiency Bonus": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+5",
          "+5",
          "+5",
          "+5",
          "+6",
          "+6",
          "+6",
          "+6"
        ],
        "Features": [
          "Rage, Unarmored Defense",
          "Reckless Attack, Danger Sense",
          "Primal Path",
          "Ability Score Improvement",
          "Extra Attack, Fast Movement",
          "Path feature",
          "Feral Instinct",
          "Ability Score Improvement",
          "Brutal Critical (1 die)",
          "Path feature",
          "Relentless",
          "Ability Score Improvement",
          "Brutal Critical (2 dice)",
          "Path feature",
          "Persistent Rage",
          "Ability Score Improvement",
          "Brutal Critical (3 dice)",
          "Indomitable Might",
          "Ability Score Improvement",
          "Primal Champion"
        ],
        "Rages": [
          "2",
          "2",
          "3",
          "3",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "5",
          "5",
          "5",
          "5",
          "5",
          "6",
          "6",
          "6",
          "Unlimited"
        ],
        "Rage Damage": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+4"
        ]
      }
    },
    "Bard": {
      "name": "Bard",
      "Hit Points": {
        "Hit Dice": "1d8",
        "Hit points at first level": "8 + CON"
      },
      "Proficiencies": {
        "Weapons": [
          "Simple",
          "Hand Crossbow",
          "Longsword",
          "Rapier",
          "Shortsword"
        ],
        "Tools": [
          "Three Musical Instruments"
        ],
        "Armor": [
          "Light armor"
        ],
        "Saving Throws": [
          "Dexterity",
          "Charisma"
        ],
        "Skills": {
          "Options": [],
          "Amount": 3
        }
      },
      "Equipment": {
        "heading": "You start with the following equipment, in addition to the equipment granted by your background:",
        "options": [
          [
            "Rapier",
            "Longsword",
            "Any simple weapon"
          ],
          [
            "Diplomat's pack",
            "Entertainer's pack"
          ],
          [
            "Lute",
            "any musical instrument"
          ],
          "Leather armor and a dagger"
        ]
      },
      "Features": {
        "Bardic Inspiration": [
          "You can inspire others through stirring words or music. To do so, you use a bonus action on your turn to choose one creature other than yourself within 60 feet of you who can hear you. That creature gains one Bardic Inspiration die, a d6.",
          "Once within the next 10 minutes, the creature can roll the die and add the number rolled to one ability check, attack roll, or saving throw it makes. The creature can wait until after it rolls the d20 before deciding to use the Bardic Inspiration die, but must decide before the GM says whether the roll succeeds or fails. Once the Bardic Inspiration die is rolled, it is lost. A creature can have only one Bardic Inspiration die at a time.",
          "You can use this feature a number of times equal to your Charisma modifier (a minimum of once). You regain any expended uses when you finish a long rest.",
          "Your Bardic Inspiration die changes when you reach certain levels in this class. The die becomes a d8 at 5th level, a d10 at 10th level, and a d12 at 15th level."
        ],
        "Jack of All Trades": "Starting at 2nd level, you can add half your proficiency bonus, rounded down, to any ability check you make that doesn’t already include your proficiency bonus.",
        "Song of Rest": [
          "Beginning at 2nd level, you can use soothing music or oration to help revitalize your wounded allies during a short rest. If you or any friendly creatures who can hear your performance regain hit points at the end of the short rest by spending one or more Hit Dice, each of those creatures regains an extra 1d6 hit points.",
          "The extra hit points increase when you reach certain levels in this class: to 1d8 at 9th level, to 1d10 at 13th level, and to 1d12 at 17th level."
        ],
        "Bard College": [
          "At 3rd level, you delve into the advanced techniques of a bard college of your choice: the College of Lore or the College of Valor, both detailed at the end of",
          "the class description. Your choice grants you features at 3rd level and again at 6th and 14th level."
        ],
        "Expertise": [
          "At 3rd level, choose two of your skill proficiencies. Your proficiency bonus is doubled for any ability check you make that uses either of the chosen proficiencies.",
          "At 10th level, you can choose another two skill proficiencies to gain this benefit."
        ],
        "Ability Score Improvement": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
        "Font of Inspiration": "Beginning when you reach 5th level, you regain all of your expended uses of Bardic Inspiration when you finish a short or long rest.",
        "Countercharm": "At 6th level, you gain the ability to use musical notes or words of power to disrupt mind-influencing effects. As an action, you can start a performance that lasts until the end of your next turn. During that time, you and any friendly creatures within 30 feet of you have advantage on saving throws against being frightened or charmed. A creature must be able to hear you to gain this benefit. The performance ends early if you are incapacitated or silenced or if you voluntarily end it (no action required).",
        "Magical Secrets": [
          "By 10th level, you have plundered magical knowledge from a wide spectrum of disciplines. Choose two spells from any class, including this one. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip.",
          "The chosen spells count as bard spells for you and are included in the number in the Spells Known column of the Bard table.",
          "You learn two additional spells from any class at 14th level and again at 18th level."
        ],
        "Superior Inspiration": "At 20th level, when you roll initiative and have no uses of Bardic Inspiration left, you regain one use.",
        "College of Lore": {
          "content": [
            "Bards of the College of Lore know something about most things, collecting bits of knowledge from sources as diverse as scholarly tomes and peasant tales. Whether singing folk ballads in taverns or elaborate compositions in royal courts, these bards use their gifts to hold audiences spellbound. When the applause dies down, the audience members might find themselves questioning everything they held to be true, from their faith in the priesthood of the local temple to their loyalty to the king.",
            "The loyalty of these bards lies in the pursuit of beauty and truth, not in fealty to a monarch or following the tenets of a deity. A noble who keeps such a bard as a herald or advisor knows that the bard would rather be honest than politic.",
            "The college’s members gather in libraries and sometimes in actual colleges, complete with classrooms and dormitories, to share their lore with one another. They also meet at festivals or affairs of state, where they can expose corruption, unravel lies, and poke fun at self-important figures of authority."
          ],
          "Bonus Proficiencies": "When you join the College of Lore at 3rd level, you gain proficiency with three skills of your choice.",
          "Cutting Words": "Also at 3rd level, you learn how to use your wit to distract, confuse, and otherwise sap the confidence and competence of others. When a creature that you can see within 60 feet of you makes an attack roll, an ability check, or a damage roll, you can use your reaction to expend one of your uses of Bardic Inspiration, rolling a Bardic Inspiration die and subtracting the number rolled from the creature’s roll. You can choose to use this feature after the creature makes its roll, but before the GM determines whether the attack roll or ability check succeeds or fails, or before the creature deals its damage. The creature is immune if it can’t hear you or if it’s immune to being charmed.",
          "Additional Magical Secrets": "At 6th level, you learn two spells of your choice from any class. A spell you choose must be of a level you can cast, as shown on the Bard table, or a cantrip. The chosen spells count as bard spells for you but don’t count against the number of bard spells you know.",
          "Peerless Skill": "Starting at 14th level, when you make an ability check, you can expend one use of Bardic Inspiration. Roll a Bardic Inspiration die and add the number rolled to your ability check. You can choose to do so after you roll the die for the ability check, but before the GM tells you whether you succeed or fail."
        }
      },
      "Spellcasting": {
        "content": [
          "You have learned to untangle and reshape the fabric of reality in harmony with your wishes and music.",
          "Your spells are part of your vast repertoire, magic that you can tune to different situations."
        ],
        "Cantrips": "You know two cantrips of your choice from the bard spell list. You learn additional bard cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Bard table.",
        "Spell Slots": {
          "content": [
            "The Bard table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.",
            "For example, if you know the 1st-level spell *cure wounds* and have a 1st-level and a 2nd-level spell slot available, you can cast *cure wounds* using either slot."
          ]
        },
        "Spells Known of 1st Level and Higher": {
          "content": [
            "You know four 1st-level spells of your choice from the bard spell list.",
            "The Spells Known column of the Bard table shows when you learn more bard spells of your choice. Each of these spells must be of a level for which you have spell slots, as shown on the table. For instance, when you reach 3rd level in this class, you can learn one new spell of 1st or 2nd level.",
            "Additionally, when you gain a level in this class, you can choose one of the bard spells you know and replace it with another spell from the bard spell list, which also must be of a level for which you have spell slots."
          ]
        },
        "Spellcasting Ability": {
          "content": [
            "Charisma is your spellcasting ability for your bard spells. Your magic comes from the heart and soul you pour into the performance of your music or oration. You use your Charisma whenever a spell refers to your spellcasting ability. In addition, you use your Charisma modifier when setting the saving throw DC for a bard spell you cast and when making an attack roll with one.",
            "**Spell save DC** = 8 + your proficiency bonus + your Charisma modifier",
            "**Spell attack modifier** = your proficiency bonus + your Charisma modifier"
          ]
        },
        "Ritual Casting": "You can cast any bard spell you know as a ritual if that spell has the ritual tag.",
        "Spellcasting Focus": "You can use a musical instrument (see chapter 5, “Equip-ment”) as a spellcasting focus for your bard spells."
      },
      "Level Table": {
        "Level": [
          "1st",
          "2nd",
          "3rd",
          "4th",
          "5th",
          "6th",
          "7th",
          "8th",
          "9th",
          "10th",
          "11th",
          "12th",
          "13th",
          "14th",
          "15th",
          "16th",
          "17th",
          "18th",
          "19th",
          "20th"
        ],
        "Proficieny Bonus": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+5",
          "+5",
          "+5",
          "+5",
          "+6",
          "+6",
          "+6",
          "+6"
        ],
        "Features": [
          "Spellcasting, Bardic Inspiration (d6)",
          "Jack of All Trades, Song of Rest (d6)",
          "Bard College, Expertise",
          "Ability Score Improvement",
          "Bardic Inspiration (d8), Font of Inspiration",
          "Countercharm, Bard College Feature",
          "-",
          "Ability Score Improvement",
          "Song of Rest (d8)",
          "Bardic Inspiration (d10), Expertise, Magical Secrets",
          "-",
          "Ability Score Improvement",
          "Song of Rest (d10)",
          "Magical Secrets, Bard College Feature",
          "Bardic Inspiration (d12)",
          "Ability Score Improvement",
          "Song of Rest (d12)",
          "Magical Secrets",
          "Ability Score Improvement",
          "Superior Inspiration"
        ],
        "Spells Known": [
          "2",
          "2",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4"
        ],
        "Cantrips Known": [
          "4",
          "5",
          "6",
          "7",
          "8",
          "9",
          "10",
          "11",
          "12",
          "14",
          "15",
          "15",
          "16",
          "18",
          "19",
          "19",
          "20",
          "22",
          "22",
          "22"
        ],
        "1st": [
          "2",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4"
        ],
        "2nd": [
          "-",
          "-",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "3rd": [
          "-",
          "-",
          "-",
          "-",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "4th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "5th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "3",
          "3",
          "3"
        ],
        "6th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "2",
          "2"
        ],
        "7th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "2"
        ],
        "8th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
        ],
        "9th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1"
        ]
      }
    },
    "Cleric": {
      "name": "Cleric",
      "Hit Points": {
        "Hit Dice": "1d8",
        "Hit points at first level": "8 + CON"
      },
      "Proficiencies": {
        "Weapons": [
          "Simple"
        ],
        "Tools": [],
        "Armor": [
          "Light armor"
        ],
        "Saving Throws": [
          "Wisdom",
          "Charisma"
        ],
        "Skills": {
          "Options": [
            "History",
            "Insight",
            "Medicine",
            "Persuasion",
            "Religion"
          ],
          "Amount": 2
        }
      },
      "Equipment": {
        "heading": "You start with the following equipment, in addition to the equipment granted by your background:",
        "options": [
          [
            "Mace",
            "Warhammer"
          ],
          [
            "Scale Mail",
            "Leather Armor",
            "Chain Mail"
          ],
          [
            "Light Crossbow",
            "Any simple weapon"
          ],
          [
            "Priest's Pack",
            "Explorer's Pack"
          ]
        ]
      },
      "Features": {
        "Divine Domain": {
          "content": "Choose one domain related to your deity: Knowledge, Life, Light, Nature, Tempest, Trickery, or War. Each domain is detailed at the end of the class description, and each one provides examples of gods associated with it. Your choice grants you domain spells and other features when you choose it at 1st level. It also grants you additional ways to use Channel Divinity when you gain that feature at 2nd level, and additional benefits at 6th, 8th, and 17th levels.",
          "Domain Spells": {
            "content": [
              "Each domain has a list of spells—its domain spells— that you gain at the cleric levels noted in the domain description. Once you gain a domain spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day.",
              "If you have a domain spell that doesn’t appear on the cleric spell list, the spell is nonetheless a cleric spell for you."
            ]
          }
        },
        "Channel Divinity": {
          "content": [
            "At 2nd level, you gain the ability to channel divine energy directly from your deity, using that energy to fuel magical effects. You start with two such effects: Turn Undead and an effect determined by your domain. Some domains grant you additional effects as you advance in levels, as noted in the domain description.",
            "When you use your Channel Divinity, you choose which effect to create. You must then finish a short or long rest to use your Channel Divinity again.",
            "Some Channel Divinity effects require saving throws. When you use such an effect from this class, the DC equals your cleric spell save DC.",
            "Beginning at 6th level, you can use your Channel",
            "Divinity twice between rests, and beginning at 18th level, you can use it three times between rests. When you finish a short or long rest, you regain your expended uses."
          ],
          "Channel Divinity: Turn Undead": {
            "content": [
              "As an action, you present your holy symbol and speak a prayer censuring the undead. Each undead that can see or hear you within 30 feet of you must make a Wisdom saving throw. If the creature fails its saving throw, it is turned for 1 minute or until it takes any damage.",
              "A turned creature must spend its turns trying to move as far away from you as it can, and it can’t willingly move to a space within 30 feet of you. It also can’t take reactions. For its action, it can use only the Dash action or try to escape from an effect that prevents it from moving. If there’s nowhere to move, the creature can use the Dodge action."
            ]
          }
        },
        "Ability Score Improvement": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
        "Destroy Undead": {
          "content": "Starting at 5th level, when an undead fails its saving throw against your Turn Undead feature, the creature is instantly destroyed if its challenge rating is at or below a certain threshold, as shown in the Destroy Undead table.",
          "Destroy Undead": {
            "table": {
              "Cleric Level": [
                "5th",
                "8th",
                "11th",
                "14th",
                "17th"
              ],
              "Destroys Undead of CR...": [
                "1/2 or lower",
                "1 or lower",
                "2 or lower",
                "3 or lower",
                "4 or lower"
              ]
            }
          }
        },
        "Divine Intervention": {
          "content": [
            "Beginning at 10th level, you can call on your deity to intervene on your behalf when your need is great.",
            "Imploring your deity’s aid requires you to use your action. Describe the assistance you seek, and roll percentile dice. If you roll a number equal to or lower than your cleric level, your deity intervenes. The GM chooses the nature of the intervention; the effect of any cleric spell or cleric domain spell would be appropriate.",
            "If your deity intervenes, you can’t use this feature again for 7 days. Otherwise, you can use it again after you finish a long rest.",
            "At 20th level, your call for intervention succeeds automatically, no roll required."
          ]
        },
        "Life Domain": {
          "content": "The Life domain focuses on the vibrant positive energy—one of the fundamental forces of the universe—that sustains all life. The gods of life promote vitality and health through healing the sick and wounded, caring for those in need, and driving away the forces of death and undeath. Almost any non-evil deity can claim influence over this domain, particularly agricultural deities (such as Chauntea, Arawai, and Demeter), sun gods (such as Lathander, Pelor, and Re-Horakhty), gods of healing or endurance (such as Ilmater, Mishakal, Apollo, and Diancecht), and gods of home and community (such as Hestia, Hathor, and Boldrei).",
          "Life Domain Spells": {
            "table": {
              "Cleric Level": [
                "1st",
                "3rd",
                "5th",
                "7th",
                "9th"
              ],
              "Spells": [
                "bless, cure wounds",
                "lesser restoration, spiritual weapon",
                "beacon of hope, revivify",
                "death ward, guardian of faith",
                "mass cure wounds, raise dead"
              ]
            }
          },
          "Bonus Proficiency": "When you choose this domain at 1st level, you gain proficiency with heavy armor.",
          "Disciple of Life": "Also starting at 1st level, your healing spells are more effective. Whenever you use a spell of 1st level or higher to restore hit points to a creature, the creature regains additional hit points equal to 2 + the spell’s level.",
          "Channel Divinity: Preserve Life": {
            "content": [
              "Starting at 2nd level, you can use your Channel Divinity to heal the badly injured.",
              "As an action, you present your holy symbol and evoke healing energy that can restore a number of hit points equal to five times your cleric level. Choose any creatures within 30 feet of you, and divide those hit points among them. This feature can restore a creature to no more than half of its hit point maximum. You can’t use this feature on an undead or a construct."
            ]
          },
          "Blessed Healer": "Beginning at 6th level, the healing spells you cast on others heal you as well. When you cast a spell of 1st level or higher that restores hit points to a creature other than you, you regain hit points equal to 2 + the spell’s level.",
          "Divine Strike": "At 8th level, you gain the ability to infuse your weapon strikes with divine energy. Once on each of your turns when you hit a creature with a weapon attack, you can cause the attack to deal an extra 1d8 radiant damage to the target. When you reach 14th level, the extra damage increases to 2d8.",
          "Supreme Healing": "Starting at 17th level, when you would normally roll one or more dice to restore hit points with a spell, you instead use the highest number possible for each die. For example, instead of restoring 2d6 hit points to a creature, you restore 12."
        }
      },
      "Level Table": {
        "Level": [
          "1st",
          "2nd",
          "3rd",
          "4th",
          "5th",
          "6th",
          "7th",
          "8th",
          "9th",
          "10th",
          "11th",
          "12th",
          "13th",
          "14th",
          "15th",
          "16th",
          "17th",
          "18th",
          "19th",
          "20th"
        ],
        "Proficiency Bonus": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+5",
          "+5",
          "+5",
          "+5",
          "+6",
          "+6",
          "+6",
          "+6"
        ],
        "Features": [
          "Spellcasting, Divine Domain",
          "Channel Divinity (1/rest), Divine Domain Feature",
          "-",
          "Ability Score Improvement",
          "Destroy Undead (CR 1/2)",
          "Channel Divinity (2/rest), Divine Domain Feature",
          "-",
          "Ability Score Improvement, Destroy Undead (CR 1), Divine Domain Feature",
          "-",
          "Divine Intervention",
          "Destroy Undead (CR 2)",
          "Ability Score Improvement",
          "-",
          "Destroy Undead (CR 3)",
          "-",
          "Ability Score Improvement",
          "Destroy Undead (CR 4), Divine Domain Feature",
          "Channel Divinity (3/rest)",
          "Ability Score Improvement",
          "Divine Intervention improvement"
        ],
        "Cantrips Known": [
          "3",
          "3",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "5",
          "5",
          "5",
          "5",
          "5",
          "5",
          "5",
          "5",
          "5",
          "5",
          "5"
        ],
        "1st": [
          "2",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4"
        ],
        "2nd": [
          "-",
          "-",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "3rd": [
          "-",
          "-",
          "-",
          "-",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "4th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "5th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "3",
          "3",
          "3"
        ],
        "6th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "2",
          "2"
        ],
        "7th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "2"
        ],
        "8th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
        ],
        "9th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1"
        ]
      }
    },
    "Druid": {
      "name": "Druid",
      "Hit Points": {
        "Hit Dice": "1d8",
        "Hit points at first level": "8 + CON"
      },
      "Proficiencies": {
        "Armor": [
          "Light armor",
          "Medium armor",
          "shield"
        ],
        "Weapons": [
          "Club",
          "Dagger",
          "Dart",
          "Javelin",
          "Mace",
          "Quarterstaff",
          "Scimitar",
          "Sickle",
          "Sling",
          "Spear"
        ],
        "Tools": [
          "Herbalism Kit"
        ],
        "Saving Throws": [
          "Wisdom",
          "Intelligence"
        ],
        "Skills": {
          "Options": [
            "Arcana",
            "Animal Handling",
            "Insight",
            "Medicine",
            "Nature",
            "Perception",
            "Religion",
            "Survival"
          ],
          "Amount": 2
        }
      },
      "Equipment": {
        "heading": "You start with the following equipment, in addition to the equipment granted by your background:",
        "options": [
          [
            "Wooden Shield",
            "Any simple weapon"
          ],
          [
            "Scimitar",
            "Simple melee weapon"
          ],
          "Leather armor, Explorer's pack, Druidic Focus"
        ]
      },
      "Features": {
        "Druidic": "You know Druidic, the secret language of druids. You can speak the language and use it to leave hidden messages. You and others who know this language automatically spot such a message. Others spot the message’s presence with a successful DC 15 Wisdom (Perception) check but can’t decipher it without magic.",
        "Spellcasting": {
          "content": "Drawing on the divine essence of nature itself, you can cast spells to shape that essence to your will.",
          "Cantrips": "At 1st level, you know two cantrips of your choice from the druid spell list. You learn additional druid cantrips of your choice at higher levels, as shown in the Cantrips Known column of the Druid table.",
          "Preparing and Casting Spells": {
            "content": [
              "The Druid table shows how many spell slots you have to cast your spells of 1st level and higher. To cast one of these druid spells, you must expend a slot of the spell’s level or higher. You regain all expended spell slots when you finish a long rest.",
              "You prepare the list of druid spells that are available for you to cast, choosing from the druid spell list. When you do so, choose a number of druid spells equal to your Wisdom modifier + your druid level (minimum of one spell). The spells must be of a level for which you have spell slots."
            ]
          },
          "Spellcasting Focus": "You can use a druidic focus (see chapter 5, “Equip- ment”) as a spellcasting focus for your druid spells."
        },
        "Wild Shape": {
          "content": [
            "Starting at 2nd level, you can use your action to magically assume the shape of a beast that you have seen before. You can use this feature twice. You regain expended uses when you finish a short or long rest.",
            "Your druid level determines the beasts you can transform into, as shown in the Beast Shapes table. At 2nd level, for example, you can transform into any beast that has a challenge rating of 1/4 or lower that doesn’t have a flying or swimming speed."
          ],
          "Beast Shapes": {
            "content": [
              "For example, if you are a 3rd-level druid, you have four 1st-level and two 2nd-level spell slots. With a Wisdom of 16, your list of prepared spells can include six spells of 1st or 2nd level, in any combination. If you prepare the 1st-level spell *cure wounds,* you can cast it using a 1st-level or 2nd-level slot. Casting the spell doesn’t remove it from your list of prepared spells.",
              "You can also change your list of prepared spells when you finish a long rest. Preparing a new list of druid spells requires time spent in prayer and meditation: at least 1 minute per spell level for each spell on your list."
            ]
          },
          "Spellcasting Ability": {
            "content": [
              "Wisdom is your spellcasting ability for your druid spells, since your magic draws upon your devotion and attunement to nature. You use your Wisdom whenever a spell refers to your spellcasting ability. In addition, you use your Wisdom modifier when setting the saving throw DC for a druid spell you cast and when making an attack roll with one.",
              "**Spell save DC** = 8 + your proficiency bonus + your Wisdom modifier",
              "**Spell attack modifier** = your proficiency bonus + your Wisdom modifier"
            ]
          },
          "Ritual Casting": {
            "content": [
              "You can cast a druid spell as a ritual if that spell has the ritual tag and you have the spell prepared.",
              {
                "table": {
                  "Max.": [
                    "2nd",
                    "4th",
                    "8th"
                  ],
                  "Level": [
                    "1/4",
                    "1/2",
                    "1"
                  ],
                  "CR Limitations": [
                    "No flying or swimming speed",
                    "No flying speed",
                    "—"
                  ],
                  "Example": [
                    "Wolf",
                    "Crocodile",
                    "Giant eagle"
                  ]
                }
              },
              "You can stay in a beast shape for a number of hours equal to half your druid level (rounded down). You then revert to your normal form unless you expend another use of this feature. You can revert to your normal form earlier by using a bonus action on your turn. You automatically revert if you fall unconscious, drop to 0 hit points, or die.",
              "While you are transformed, the following rules apply:",
              [
                "Your game statistics are replaced by the statistics of the beast, but you retain your alignment, personality, and Intelligence, Wisdom, and Charisma scores. You also retain all of your skill and saving throw proficiencies, in addition to gaining those of the creature. If the creature has the same proficiency as you and the bonus in its stat block is higher than yours, use the creature’s bonus instead of yours. If the creature has any legendary or lair actions, you can’t use them.",
                "When you transform, you assume the beast’s hit points and Hit Dice. When you revert to your normal form, you return to the number of hit points you had before you transformed. However, if you revert as a result of dropping to 0 hit points, any excess damage carries over to your normal form. For example, if you take 10 damage in animal form and have only 1 hit point left, you revert and take 9 damage. As long as the excess damage doesn’t reduce your normal form to 0 hit points, you aren’t knocked unconscious.",
                "You can’t cast spells, and your ability to speak or take any action that requires hands is limited to the capabilities of your beast form. Transforming doesn’t break your concentration on a spell you’ve already cast, however, or prevent you from taking actions that are part of a spell, such as *call lightning*, that you’ve already cast.",
                "You retain the benefit of any features from your class, race, or other source and can use them if the new form is physically capable of doing so. However, you can’t use any of your special senses, such as darkvision, unless your new form also has that sense.",
                "You choose whether your equipment falls to the ground in your space, merges into your new form, or is worn by it. Worn equipment functions as normal, but the GM decides whether it is practical for the new form to wear a piece of equipment, based on the creature’s shape and size. Your equipment doesn’t change size or shape to match the new form, and any equipment that the new form can’t wear must either fall to the ground or merge with it. Equipment that merges with the form has no effect until you leave the form."
              ]
            ]
          }
        },
        "Druid Circle": "At 2nd level, you choose to identify with a circle of druids: the Circle of the Land or the Circle of the Moon, both detailed at the end of the class description. Your choice grants you features at 2nd level and again at 6th, 10th, and 14th level.",
        "Ability Score Improvement": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
        "Timeless Body": "Starting at 18th level, the primal magic that you wield causes you to age more slowly. For every 10 years that pass, your body ages only 1 year.",
        "Beast Spells": "Beginning at 18th level, you can cast many of your druid spells in any shape you assume using Wild Shape. You can perform the somatic and verbal components of a druid spell while in a beast shape, but you aren’t able to provide material components.",
        "Archdruid": {
          "content": [
            "At 20th level, you can use your Wild Shape an unlimited number of times.",
            "Additionally, you can ignore the verbal and somatic components of your druid spells, as well as any material components that lack a cost and aren’t consumed by a spell. You gain this benefit in both your normal shape and your beast shape from Wild Shape."
          ]
        },
        "Circle of the Land": {
          "content": "The Circle of the Land is made up of mystics and sages who safeguard ancient knowledge and rites through a vast oral tradition. These druids meet within sacred circles of trees or standing stones to whisper primal secrets in Druidic. The circle’s wisest members preside as the chief priests of communities that hold to the Old Faith and serve as advisors to the rulers of those folk. As a member of this circle, your magic is influenced by the land where you were initiated into the circle’s mysterious rites.",
          "Bonus Cantrip": "When you choose this circle at 2nd level, you learn one additional druid cantrip of your choice.",
          "Natural Recovery": {
            "content": [
              "Starting at 2nd level, you can regain some of your magical energy by sitting in meditation and communing with nature. During a short rest, you choose expended spell slots to recover. The spell slots can have a combined level that is equal to or less than half your druid level (rounded up), and none of the slots can be 6th level or higher. You can’t use this feature again until you finish a long rest.",
              "For example, when you are a 4th-level druid, you can recover up to two levels worth of spell slots. You can recover either a 2nd-level slot or two 1st-level slots."
            ]
          },
          "Circle Spells": {
            "content": [
              "Your mystical connection to the land infuses you with the ability to cast certain spells. At 3rd, 5th, 7th, and 9th level you gain access to circle spells connected to the land where you became a druid. Choose that land—arctic, coast, desert, forest, grassland, mountain, or swamp—and consult the associated list of spells.",
              "Once you gain access to a circle spell, you always have it prepared, and it doesn’t count against the number of spells you can prepare each day. If you gain access to a spell that doesn’t appear on the druid spell list, the spell is nonetheless a druid spell for you."
            ],
            "Arctic": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "hold person, spike growth",
                  "sleet storm, slow",
                  "freedom of movement, ice storm",
                  "commune with nature, cone of cold"
                ]
              }
            },
            "Coast": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "mirror image, misty step",
                  "water breathing, water walk",
                  "control water, freedom of movement",
                  "conjure elemental, scrying"
                ]
              }
            },
            "Desert": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "blur, silence",
                  "create food and water, protection from energy",
                  "blight, hallucinatory terrain",
                  "insect plague, wall of stone"
                ]
              }
            },
            "Forest": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "barkskin, spider climb",
                  "call lightning, plant growth",
                  "divination, freedom of movement",
                  "commune with nature, tree stride"
                ]
              }
            },
            "Grassland": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "invisibility, pass without trace",
                  "daylight, haste",
                  "divination, freedom of movement",
                  "dream, insect plague"
                ]
              }
            },
            "Mountain": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "spider climb, spike growth",
                  "lightning bolt, meld into stone",
                  "stone shape, stoneskin",
                  "passwall, wall of stone"
                ]
              }
            },
            "Swamp": {
              "table": {
                "Druid Level": [
                  "3rd",
                  "5th",
                  "7th",
                  "9th"
                ],
                "Circle Spells": [
                  "acid arrow, darkness",
                  "water walk, stinking cloud",
                  "freedom of movement, locate creature",
                  "insect plague, scrying"
                ]
              }
            }
          },
          "Land’s Stride": {
            "content": [
              "Starting at 6th level, moving through nonmagical difficult terrain costs you no extra movement. You can also pass through nonmagical plants without being slowed by them and without taking damage from them if they have thorns, spines, or a similar hazard.",
              "In addition, you have advantage on saving throws against plants that are magically created or manipulated to impede movement, such those created by the *entangle* spell."
            ]
          },
          "Nature’s Ward": "When you reach 10th level, you can’t be charmed or frightened by elementals or fey, and you are immune to poison and disease.",
          "Nature’s Sanctuary": {
            "content": [
              "When you reach 14th level, creatures of the natural world sense your connection to nature and become hesitant to attack you. When a beast or plant creature attacks you, that creature must make a Wisdom saving throw against your druid spell save DC. On a failed save, the creature must choose a different target, or the attack automatically misses. On a successful save, the creature is immune to this effect for 24 hours.",
              "The creature is aware of this effect before it makes its attack against you."
            ]
          }
        },
        "Sacred Plants and Wood": {
          "content": [
            "A druid holds certain plants to be sacred, particularly alder, ash, birch, elder, hazel, holly, juniper, mistletoe, oak, rowan, willow, and yew. Druids often use such plants as part of a spellcasting focus, incorporating lengths of oak or yew or sprigs of mistletoe.",
            "Similarly, a druid uses such woods to make other objects, such as weapons and shields. Yew is associated with death and rebirth, so weapon handles for scimitars or sickles might be fashioned from it. Ash is associated with life and oak with strength. These woods make excellent hafts or whole weapons, such as clubs or quarterstaffs, as well as shields. Alder is associated with air, and it might be used for thrown weapons, such as darts or javelins.",
            "Druids from regions that lack the plants described here have chosen other plants to take on similar uses. For instance, a druid of a desert region might value the yucca tree and cactus plants."
          ]
        },
        "Druids and the Gods": "Some druids venerate the forces of nature themselves, but most druids are devoted to one of the many nature deities worshiped in the multiverse (the lists of gods in appendix B include many such deities). The worship of these deities is often considered a more ancient tradition than the faiths of clerics and urbanized peoples."
      },
      "Level Table": {
        "Level": [
          "1st",
          "2nd",
          "3rd",
          "4th",
          "5th",
          "6th",
          "7th",
          "8th",
          "9th",
          "10th",
          "11th",
          "12th",
          "13th",
          "14th",
          "15th",
          "16th",
          "17th",
          "18th",
          "19th",
          "20th"
        ],
        "Proficiency Bonus": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+5",
          "+5",
          "+5",
          "+5",
          "+6",
          "+6",
          "+6",
          "+6"
        ],
        "Features": [
          "Druidic, Spellcasting",
          "Wild Shape, Druid Circle",
          "-",
          "Wild Shape Improvement, Ability Score Improvement",
          "-",
          "Druid Circle feature",
          "-",
          "Wild Shape Improvement, Ability Score Improvement",
          "-",
          "Druid Circle feature",
          "-",
          "Ability Score Improvement",
          "-",
          "Druid Circle feature",
          "-",
          "Ability Score Improvement",
          "-",
          "Timeless Body, Beast Spells",
          "Ability Score Improvement",
          "Archdruid"
        ],
        "Cantrips Known": [
          "2",
          "2",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4"
        ],
        "1st": [
          "2",
          "3",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4",
          "4"
        ],
        "2nd": [
          "-",
          "-",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "3rd": [
          "-",
          "-",
          "-",
          "-",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "4th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "2",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3",
          "3"
        ],
        "5th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "2",
          "3",
          "3",
          "3"
        ],
        "6th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "2",
          "2"
        ],
        "7th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1",
          "2"
        ],
        "8th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1",
          "1",
          "1"
        ],
        "9th": [
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "-",
          "1",
          "1",
          "1",
          "1"
        ]
      }
    },
    "Fighter": {
      "name": "Fighter",
      "Hit Points": {
        "Hit Dice": "1d10",
        "Hit points at first level": "10 + CON"
      },
      "Proficiencies": {
        "Armor": [
          "Light armor",
          "Medium armor",
          "Heavy Armor",
          "shield"
        ],
        "Weapons": [
          "Simple Weapons",
          "Martial Weapons"
        ],
        "Tools": [],
        "Saving Throws": [
          "Strength",
          "Constitution"
        ],
        "Skills": {
          "Options": [
            "Acrobatics",
            "Animal Handling",
            "Athletics",
            "History",
            "Insight",
            "Intimidation",
            "Perception",
            "Survival"
          ],
          "Amount": 2
        }
      },
      "Equipment": {
        "heading": "You start with the following equipment, in addition to the equipment granted by your background:",
        "options": [
          [
            "Chain Mail",
            "Leather Armor",
            "Longbow, arrows(20)"
          ],
          [
            "Martial Weapon, Shield",
            "2 Martial Weapons"
          ],
          [
            "Light Crossbow",
            "Two Handaxes"
          ],
          [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ]
        ]
      },
      "Features": {
        "Fighting Style": {
          "content": "You adopt a particular style of fighting as your specialty. Choose one of the following options. You can’t take a Fighting Style option more than once, even if you later get to choose again.",
          "Archery": "You gain a +2 bonus to attack rolls you make with ranged weapons.",
          "Defense": "While you are wearing armor, you gain a +1 bonus to AC.",
          "Dueling": "When you are wielding a melee weapon in one hand and no other weapons, you gain a +2 bonus to damage rolls with that weapon.",
          "Great Weapon Fighting": "When you roll a 1 or 2 on a damage die for an attack you make with a melee weapon that you are wielding with two hands, you can reroll the die and must use the new roll, even if the new roll is a 1 or a 2. The weapon must have the two-handed or versatile property for you to gain this benefit.",
          "Protection": "When a creature you can see attacks a target other than you that is within 5 feet of you, you can use your reaction to impose disadvantage on the attack roll. You must be wielding a shield.",
          "Two-Weapon Fighting": "When you engage in two-weapon fighting, you can add your ability modifier to the damage of the second attack."
        },
        "Second Wind": "You have a limited well of stamina that you can draw on to protect yourself from harm. On your turn, you can use a bonus action to regain hit points equal to 1d10 + your fighter level. Once you use this feature, you must finish a short or long rest before you can use it again.",
        "Action Surge": {
          "content": [
            "Starting at 2nd level, you can push yourself beyond your normal limits for a moment. On your turn, you can take one additional action on top of your regular action and a possible bonus action.",
            "Once you use this feature, you must finish a short or long rest before you can use it again. Starting at 17th level, you can use it twice before a rest, but only once on the same turn."
          ]
        },
        "Martial Archetype": "At 3rd level, you choose an archetype that you strive to emulate in your combat styles and techniques. Choose Champion, Battle Master, or Eldritch Knight, all detailed at the end of the class description. The archetype you choose grants you features at 3rd level and again at 7th, 10th, 15th, and 18th level.",
        "Ability Score Improvement": "When you reach 4th level, and again at 6th, 8th, 12th, 14th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
        "Extra Attack": {
          "content": [
            "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
            "The number of attacks increases to three when you reach 11th level in this class and to four when you reach 20th level in this class."
          ]
        },
        "Indomitable": {
          "content": [
            "Beginning at 9th level, you can reroll a saving throw that you fail. If you do so, you must use the new roll, and you can’t use this feature again until you finish a long rest.",
            "You can use this feature twice between long rests starting at 13th level and three times between long rests starting at 17th level."
          ]
        }
      },
      "Level Table": {
        "Features": [
          "Fighting Style, Second Wind",
          "Action Surge (one use)",
          "Martial Archetype",
          "Ability Score Improvement",
          "Extra Attack",
          "Ability Score Improvement",
          "Martial Archetype Feature",
          "Ability Score Improvement",
          "Indomitable (one use)",
          "Martial Archetype Feature",
          "Extra Attack (2)",
          "Ability Score Improvement",
          "Indomitable (two uses)",
          "Ability Score Improvement",
          "Martial Archetype Feature",
          "Ability Score Improvement",
          "Action Surge (two uses), Indomitable (three uses)",
          "Martial Archetype Feature",
          "Ability Score Improvement",
          "Extra Attack (3)"
        ],
        "Level": [
          "1st",
          "2nd",
          "3rd",
          "4th",
          "5th",
          "6th",
          "7th",
          "8th",
          "9th",
          "10th",
          "11th",
          "12th",
          "13th",
          "14th",
          "15th",
          "16th",
          "17th",
          "18th",
          "19th",
          "20th"
        ],
        "Proficiency Bonus": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+5",
          "+5",
          "+5",
          "+5",
          "+6",
          "+6",
          "+6",
          "+6"
        ]
      }
    },
    "Monk": {
      "name": "Monk",
      "Hit Points": {
        "Hit Dice": "1d8",
        "Hit points at first level": "8 + CON"
      },
      "Proficiencies": {
        "Armor": [],
        "Weapons": [
          "Simple Weapons",
          "Shortsword"
        ],
        "Tools": [
          "Artisan Tools",
          "Musical Instrument"
        ],
        "Saving Throws": [
          "Strength",
          "Dexterity"
        ],
        "Skills": {
          "Options": [
            "Acrobatics",
            "Athletics",
            "History",
            "Insight",
            "Religion",
            "Stealth"
          ],
          "Amount": 2
        }
      },
      "Equipment": {
        "heading": "You start with the following equipment, in addition to the equipment granted by your background:",
        "options": [
          [
            "Shortsword",
            "Any simple weapon"
          ],
          [
            "Dungeoneer's Pack",
            "Explorer's Pack"
          ],
          "Darts(10)"
        ]
      },
      "Features": {
        "Unarmored Defense": "Beginning at 1st level, while you are wearing no armor and not wielding a shield, your AC equals 10 + your Dexterity modifier + your Wisdom modifier.",
        "Martial Arts": {
          "content": [
            "At 1st level, your practice of martial arts gives you mastery of combat styles that use unarmed strikes and monk weapons, which are shortswords and any simple melee weapons that don’t have the two- handed or heavy property.",
            "You gain the following benefits while you are unarmed or wielding only monk weapons and you aren’t wearing armor or wielding a shield:",
            [
              "You can use Dexterity instead of Strength for the attack and damage rolls of your unarmed strikes and monk weapons.",
              "You can roll a d4 in place of the normal damage of your unarmed strike or monk weapon. This die changes as you gain monk levels, as shown in the Martial Arts column of the Monk table.",
              "When you use the Attack action with an unarmed strike or a monk weapon on your turn, you can make one unarmed strike as a bonus action. For example, if you take the Attack action and attack with a quarterstaff, you can also make an unarmed strike as a bonus action, assuming you haven’t already taken a bonus action this turn."
            ],
            "Certain monasteries use specialized forms of the monk weapons. For example, you might use a club that is two lengths of wood connected by a short chain (called a nunchaku) or a sickle with a shorter, straighter blade (called a kama). Whatever name you use for a monk weapon, you can use the game statistics provided for the weapon."
          ]
        },
        "Ki": {
          "content": [
            "Starting at 2nd level, your training allows you to harness the mystic energy of ki. Your access to this energy is represented by a number of ki points. Your monk level determines the number of points you have, as shown in the Ki Points column of the Monk table.",
            "You can spend these points to fuel various ki features. You start knowing three such features: Flurry of Blows, Patient Defense, and Step of the Wind. You learn more ki features as you gain levels in this class.",
            "When you spend a ki point, it is unavailable until you finish a short or long rest, at the end of which you draw all of your expended ki back into yourself. You must spend at least 30 minutes of the rest meditating to regain your ki points.",
            "Some of your ki features require your target to make a saving throw to resist the feature’s effects. The saving throw DC is calculated as follows:",
            "**Ki save DC** = 8 + your proficiency bonus + your Wisdom modifier"
          ],
          "Flurry of Blows": "Immediately after you take the Attack action on your turn, you can spend 1 ki point to make two unarmed strikes as a bonus action.",
          "Patient Defense": "You can spend 1 ki point to take the Dodge action as a bonus action on your turn.",
          "Step of the Wind": "You can spend 1 ki point to take the Disengage or Dash action as a bonus action on your turn, and your jump distance is doubled for the turn."
        },
        "Unarmored Movement": {
          "content": [
            "Starting at 2nd level, your speed increases by 10 feet while you are not wearing armor or wielding a shield. This bonus increases when you reach certain monk levels, as shown in the Monk table.",
            "At 9th level, you gain the ability to move along vertical surfaces and across liquids on your turn without falling during the move."
          ]
        },
        "Monastic Tradition": "When you reach 3rd level, you commit yourself to a monastic tradition: the Way of the Open Hand, the Way of Shadow, or the Way of the Four Elements, all detailed at the end of the class description. Your tradition grants you features at 3rd level and again at 6th, 11th, and 17th level.",
        "Deflect Missiles": {
          "content": [
            "Starting at 3rd level, you can use your reaction to deflect or catch the missile when you are hit by a ranged weapon attack. When you do so, the damage you take from the attack is reduced by 1d10 + your Dexterity modifier + your monk level.",
            "If you reduce the damage to 0, you can catch the missile if it is small enough for you to hold in one hand and you have at least one hand free. If you catch a missile in this way, you can spend 1 ki point to make a ranged attack with the weapon or piece of ammunition you just caught, as part of the same reaction. You make this attack with proficiency, regardless of your weapon proficiencies, and the missile counts as a monk weapon for the attack, which has a normal range of 20 feet and a long range of 60 feet."
          ]
        },
        "Ability Score Improvement": "When you reach 4th level, and again at 8th, 12th, 16th, and 19th level, you can increase one ability score of your choice by 2, or you can increase two ability scores of your choice by 1. As normal, you can’t increase an ability score above 20 using this feature.",
        "Slow Fall": "Beginning at 4th level, you can use your reaction when you fall to reduce any falling damage you take by an amount equal to five times your monk level.",
        "Extra Attack": "Beginning at 5th level, you can attack twice, instead of once, whenever you take the Attack action on your turn.",
        "Stunning Strike": "Starting at 5th level, you can interfere with the flow of ki in an opponent’s body. When you hit another creature with a melee weapon attack, you can spend 1 ki point to attempt a stunning strike. The target must succeed on a Constitution saving throw or be stunned until the end of your next turn.",
        "Ki-Empowered Strikes": "Starting at 6th level, your unarmed strikes count as magical for the purpose of overcoming resistance and immunity to nonmagical attacks and damage.",
        "Evasion": "At 7th level, your instinctive agility lets you dodge out of the way of certain area effects, such as a blue dragon’s lightning breath or a *fireball* spell. When you are subjected to an effect that allows you to make a Dexterity saving throw to take only half damage, you instead take no damage if you succeed on the saving throw, and only half damage if you fail.",
        "Stillness of Mind": "Starting at 7th level, you can use your action to end one effect on yourself that is causing you to be charmed or frightened.",
        "Purity of Body": "At 10th level, your mastery of the ki flowing through you makes you immune to disease and poison.",
        "Tongue of the Sun and Moon": "Starting at 13th level, you learn to touch the ki of other minds so that you understand all spoken languages. Moreover, any creature that can understand a language can understand what you say.",
        "Diamond Soul": {
          "content": [
            "Beginning at 14th level, your mastery of ki grants you proficiency in all saving throws.",
            "Additionally, whenever you make a saving throw and fail, you can spend 1 ki point to reroll it and take the second result."
          ]
        },
        "Timeless Body": "At 15th level, your ki sustains you so that you suffer none of the frailty of old age, and you can’t be aged magically. You can still die of old age, however. In addition, you no longer need food or water.",
        "Empty Body": {
          "content": [
            "Beginning at 18th level, you can use your action to spend 4 ki points to become invisible for 1 minute. During that time, you also have resistance to all damage but force damage.",
            "Additionally, you can spend 8 ki points to cast the *astral projection* spell, without needing material components. When you do so, you can’t take any other creatures with you."
          ]
        },
        "Perfect Self": "At 20th level, when you roll for initiative and have no ki points remaining, you regain 4 ki points."
      },
      "Level Table": {
        "Level": [
          "1st",
          "2nd",
          "3rd",
          "4th",
          "5th",
          "6th",
          "7th",
          "8th",
          "9th",
          "10th",
          "11th",
          "12th",
          "13th",
          "14th",
          "15th",
          "16th",
          "17th",
          "18th",
          "19th",
          "20th"
        ],
        "Proficiency Bonus": [
          "+2",
          "+2",
          "+2",
          "+2",
          "+3",
          "+3",
          "+3",
          "+3",
          "+4",
          "+4",
          "+4",
          "+4",
          "+5",
          "+5",
          "+5",
          "+5",
          "+6",
          "+6",
          "+6",
          "+6"
        ],
        "Martial Arts": [
          "1d4",
          "1d4",
          "1d4",
          "1d4",
          "1d6",
          "1d6",
          "1d6",
          "1d6",
          "1d6",
          "1d6",
          "1d8",
          "1d8",
          "1d8",
          "1d8",
          "1d8",
          "1d8",
          "1d10",
          "1d10",
          "1d10",
          "1d10"
        ],
        "Ki Points": [
          "—",
          "2",
          "3",
          "4",
          "5",
          "6",
          "7",
          "8",
          "9",
          "10",
          "11",
          "12",
          "13",
          "14",
          "15",
          "16",
          "17",
          "18",
          "19",
          "20"
        ],
        "Unarmored Movement": [
          "-",
          "+10 ft.",
          "+10 ft.",
          "+10 ft.",
          "+10 ft.",
          "+15 ft.",
          "+15 ft.",
          "+15 ft.",
          "+15 ft.",
          "+20 ft.",
          "+20 ft.",
          "+20 ft.",
          "+20 ft.",
          "+25 ft.",
          "+25 ft.",
          "+25 ft.",
          "+25 ft.",
          "+30 ft.",
          "+30 ft.",
          "+30 ft."
        ],
        "Features": [
          "Unarmored Defense, Martial Arts",
          "Ki, Unarmored Movement",
          "Monastic Tradition, Deflect Missiles",
          "Ability Score Improvement, Slow Fall",
          "Extra Attack, Stunning Strike",
          "Ki-Empowered Strikes, Monastic Tradition Feature",
          "Evasion, Stillness of Mind",
          "Ability Score Improvement",
          "Unarmored Movement improvement",
          "Purity of Body",
          "Monastic Tradition Feature",
          "Ability Score Improvement",
          "Tongue of the Sun and Moon",
          "Diamond Soul",
          "Timeless Body",
          "Ability Score Improvement",
          "Monastic Tradition Feature",
          "Empty Body",
          "Ability Score Improvement",
          "Perfect Self"
        ]
      }
    }
  }